---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterValueRule
source: html/3a7debc3-e476-9c37-24bf-0b83182602d5.htm
---
# FilterValueRule Properties

Specifies whether the .NET object represents a valid Revit entity.